In [1]:
import pandas as pd

# Ejemplo de Pivot

In [3]:
# Creamos un DataFrame con los datos originales
df = pd.DataFrame({
    'País': ['USA', 'USA', 'India', 'India'],
    'Año': [2000, 2010, 2000, 2010],
    'Población': [282162411, 308745538, 1006300000, 1205624727]
})
df

    País   Año   Población
0    USA  2000   282162411
1    USA  2010   308745538
2  India  2000  1006300000
3  India  2010  1205624727

In [4]:
# Utilizamos la función pivot para reorganizar los datos
df.pivot(index='País', columns='Año', values='Población')

Año          2000        2010
País
India  1006300000  1205624727
USA     282162411   308745538

# Ejemplo de Melt

In [5]:
df = pd.DataFrame({
    'País': ['USA', 'USA', 'India', 'India'],
    '2000': [282162411, None, 1006300000, None],
    '2010': [None, 308745538, None, 1205624727]
})
df

    País          2000          2010
0    USA  2.821624e+08           NaN
1    USA           NaN  3.087455e+08
2  India  1.006300e+09           NaN
3  India           NaN  1.205625e+09

In [7]:
df.melt(id_vars='País', var_name='Año', value_name='Población').dropna()

    País   Año     Población
0    USA  2000  2.821624e+08
2  India  2000  1.006300e+09
5    USA  2010  3.087455e+08
7  India  2010  1.205625e+09